{"id":20,"date":"2021-08-28T19:37:29","date_gmt":"2021-08-28T19:37:29","guid":{"rendered":"http:\/\/54.196.245.19\/?p=20"},"modified":"2021-08-28T19:37:29","modified_gmt":"2021-08-28T19:37:29","slug":"the-three-way-deadlock","status":"publish","type":"post","link":"http:\/\/54.209.23.214\/2021\/08\/28\/the-three-way-deadlock\/","title":{"rendered":"The Three-way Deadlock"},"content":{"rendered":"\n<p>Stoicism philosophy is on the rise. I have been practicing&nbsp;it for a couple of years now and would like to share 3 of the most effective and practical mental exercise\/meditations that I have used.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/www.blogger.com\/blog\/post\/edit\/6519188314280087894\/5102324031575703399#\"><img src=\"https:\/\/lh3.googleusercontent.com\/-bsrV1Tv7Fy4\/X66ZZ9wYr5I\/AAAAAAAABXU\/FeZ9WuA-sRIUeFwFJnezjueoYE0-njlJQCLcBGAsYHQ\/w521-h283\/image.png\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<h3>Method One: A view from&nbsp;above<\/h3>\n\n\n\n<p>&#8216;You can rid yourself of many useless things among those that disturb you, for they lie entirely in your imagination; and you will then gain for yourself ample space by comprehending the whole universe in your mind, and by contemplating the eternity of time, and observing the rapid change of every part of everything, how short is the time from birth to dissolution, and the illimitable time before birth as well as the equally boundless time after dissolution&#8217;<\/p>\n\n\n\n<p>–&nbsp;<strong>Marcus Aurelius<\/strong><\/p>\n\n\n\n<p>Marcus Aurelius advises us to perform an exercise called &#8216;view from above&#8217;. This exercise involves us envisioning ourselves from the third person. In this vision, we zoom out while keeping ourselves in the center. We continue zooming out and contemplating the scale of the universe. For instance, your first zoom might encompass a view of you from above the roof of your house. Increase the magnitude and you might see a view of your street, increase the magnitude and you might see a view of your country. Keep going until you can picture a view of Earth from the stars.<\/p>\n\n\n\n<p>With this scale, we can gain a better perspective on the insignificance of our problems. When compared to the universe whatever problems we might appear incredibly trivial. For instance, if you were feeling down because a girl flaked on you or someone insulted you, try this exercise. It is far easier to overcome the emotional hurdles we experience when we put things into perspective.<\/p>\n\n\n\n<h3>Method Two: Negative visualization<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/-MS6g2NCxgWo\/X66YbNsWj6I\/AAAAAAAABXI\/C-AYCDn3gYMGZF8s0Y9O_ES4dgN1vHXQgCLcBGAsYHQ\/w448-h252\/image.png\" alt=\"\"\/><\/figure>\n\n\n\n<p><a href=\"https:\/\/www.blogger.com\/blog\/post\/edit\/6519188314280087894\/5102324031575703399#\"><\/a><\/p>\n\n\n\n<p><em>&#8216;Remember that all we have is “on loan” from Fortune, which can reclaim it without our permission—indeed, without even advance notice. Thus, we should love all our dear ones, but always with the thought that we have no promise that we may keep them forever—nay, no promise even that we may keep them for long.&#8217;<\/em><\/p>\n\n\n\n<p>&#8211;&nbsp;<strong>Seneca<\/strong><\/p>\n\n\n\n<p>Negative visualization despite the name is an exercise that will increase your default level of happiness if practiced consistently. The exercise consists of you envisioning what it would feel like if you lost certain things from your life. Some of the things that you could consider during the exercise are:<\/p>\n\n\n\n<p>• How it would feel to not have a roof over your head.<\/p>\n\n\n\n<p>• How it would feel to lose social status.<\/p>\n\n\n\n<p>• How it would feel to live in a third world country.<\/p>\n\n\n\n<p>• How it would feel to have a physical disability.<\/p>\n\n\n\n<p>• How it would feel to lose a loved one.<\/p>\n\n\n\n<p>This exercise is not meant to be dark or morbid, it’s meant to put things into perspective. Allowing you to see how lucky you truly are. It also prepares you for the worst case scenarios in which one of these things does happen.&nbsp;You are not meant to fixate on these thoughts, but consider them from time to time.<\/p>\n\n\n\n<p>This is a very practical way for you to practice gratitude, naturally, when you consider things being removed from your life, you start to gain a sense of gratitude. Now gratitude is important because of a thing called ‘hedonic adaptation’, basically, it’s a term that defines the tendency for humans to always go back to their default level of happiness.<\/p>\n\n\n\n<p>If you won the lotto and became a millionaire, your base level of happiness will increase for a while. However, when you become accustomed to the lifestyle, despite all the new toys, you will return to your base level. Gratitude breaks this pattern, allowing you to enjoy each step on the ladder. You can be grateful when you own a box, and you can be grateful when you own a Lamborghini Aventador.<\/p>\n\n\n\n<h3>Method Three: Voluntary Discomfort<\/h3>\n\n\n\n<figure class=\"wp-block-image\"><a href=\"https:\/\/www.blogger.com\/blog\/post\/edit\/6519188314280087894\/5102324031575703399#\"><img src=\"https:\/\/lh3.googleusercontent.com\/-_ARlj_a-CR4\/X66bRDyH56I\/AAAAAAAABXg\/XRRqHbzFgFMLixgG68yFgVMaQdb6zjiwQCLcBGAsYHQ\/w529-h276\/image.png\" alt=\"\"\/><\/a><\/figure>\n\n\n\n<p><em>&#8216;But neither a bull nor a noble-spirited man comes to be what he is all at once; he must undertake hard winter training, and prepare himself, and not propel himself rashly into what is not appropriate to him&#8217;<\/em><\/p>\n\n\n\n<p>&#8211;&nbsp;<strong>Epictetus<\/strong><\/p>\n\n\n\n<p>The last exercise has been advised to us by Epictetus. It is called &#8216;voluntary discomfort&#8217;. In this exercise, we are going to deliberately put ourselves through uncomfortable situations. We will do this in order to train ourselves to not hold onto comfort with such high regard. We can perform voluntary discomfort in a number of ways. Some suggestions are:<\/p>\n\n\n\n<p>• Cold Showers<\/p>\n\n\n\n<p>• Exercising in the morning<\/p>\n\n\n\n<p>• Walking in the cold without a jumper<\/p>\n\n\n\n<p>• Fasting for a day<\/p>\n\n\n\n<p>• Sleeping on the floor<\/p>\n\n\n\n<p>All these things will change your relationship with comfort. Once you overcome the need for comfort, life will become much easier. Setting your goals and sticking to them will be far easier. When most people complain about being ‘uncomfortable’, you won’t be able to relate. You are literally training yourself to be like a Navy Seal. This method will harden you up for life.<\/p>\n\n\n\n<p>Eventually the storm will hit the house at some stage during your life. You want to have to mental and physical fortitude to weather the storm.<\/p>\n\n\n\n<p>So those are the three stoic exercises. Stoicism is a practical philosophy that has survived the test of time due to its universal applications. If you practice these stoic meditations, you will be well on your way to the good life.<\/p>\n\n\n\n<p>                                                                                                  Credits: thegolddawg.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Stoicism philosophy is on the rise. I have been practicing&nbsp;it for a couple of years now and would like to share 3 of the most effective and practical mental exercise\/meditations that I have used. Method One: A view from&nbsp;above &#8216;You can rid yourself of many useless things among those that disturb you, for they lie&hellip; <a class=\"more-link\" href=\"http:\/\/54.209.23.214\/2021\/08\/28\/the-three-way-deadlock\/\">Continue reading <span class=\"screen-reader-text\">The Three-way Deadlock<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/posts\/20"}],"collection":[{"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/comments?post=20"}],"version-history":[{"count":1,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/posts\/20\/revisions"}],"predecessor-version":[{"id":21,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/posts\/20\/revisions\/21"}],"wp:attachment":[{"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/media?parent=20"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/categories?post=20"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/54.209.23.214\/wp-json\/wp\/v2\/tags?post=20"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}